---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.ToposolidFloorOverlap
source: html/773408da-1424-d3c6-d9bd-16a6ad975bd2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.ToposolidFloorOverlap Property

Highlighted toposolid and floor overlap.

## Syntax (C#)
```csharp
public static FailureDefinitionId ToposolidFloorOverlap { get; }
```